Revit 2027 API
OverrideGraphicSettings.SetCutBackgroundPatternVisible Method
 Sets the visibility of the cut face background fill pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetCutBackgroundPatternVisible(
	bool fillPatternVisible
)
Public Function SetCutBackgroundPatternVisible (
	fillPatternVisible As Boolean
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetCutBackgroundPatternVisible(
	bool fillPatternVisible
)
member SetCutBackgroundPatternVisible :
        fillPatternVisible : bool -> OverrideGraphicSettings
Parameters
fillPatternVisible Boolean
 Value of the visibility of the cut face background fill pattern.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace